# print("\5,\4,\3,\2,\1")
# print("Результат:", max(5,2,4,6,-10,20,69,-69,7))
# print("Результат:", min(5,2,4,6,-10,20,69,-69,7))
# print("Результат:", abs(-5))
# print("Результат:", pow(5, 3))
# print("Результат:", round(16/5))


# number_1 = int(input("Введите число "))
# print(number_1)

# num_1 = 1 #int
# num_2 = 2
# word = "Результат:" #string
# boolean = False #bool

# gg = '5' #string

# print(word+ str(num_1+int(gg)))

# print(word, num_1, num_2, boolean)
# print(num_1+num_2)


# n1 = int(input("Введите первое число:"))

# n2 = int(input("Введите второе число:"))

# n1 += 5

# print("Result:+", n1 + n2)
# print("Result:-", n1 - n2)
# print("Result:/", n1 / n2)
# print("Result:*", n1 * n2)
# print("Result:**", n1 ** n2)
# print("Result:"'//', n1 // n2)

# word = "Hi Hitler"
# print(word * 10)

# user_data = int(input("Введите число:  "))

# if user_data != 5:
#     print("Мы на месте")
#     if user_data > 6: 
#         print("Number is bigger than 5")

# n1 = 10
# n2 = 50
# n3 = 9.999

# print(f"{n1}+{n2}+{n3}={n1+n2+n3}")


# print("Вы 34 летний бездомный безрабочий человек. Ваша одежда потрёпана и сильно воняет.")
# print("1) Осмотреться 2) лежать дальше")

# choice = input("Что ты выберешь? (1/2): ")

# if choice == "1":
#     print("\nВы видите что находитесь в переулке среди мусора.")
#     print("\nВдруг вы видите как мимо вас проходит мужчина в официальной одежде. Он выглядит очень трявожным.\n Не давая тебе обдумать всё он быстро скрывается в бочке мусора. \nТут же после этого в переулоке появяется кучка людей с холодным оружием. Один из них подходит к тебе и спрашивает:")
#     print("-Эй ты. Ты не видел тут мужика в пиджаке?")
#     print("1) Он в мусорке 2) Он побежал дальше по переулку")
    
#     choice2 = input("Что ты выберешь? (1/2): ")
#     if choice2 == "1":
#         print("Они находят его в мусорке и забирают с собой.\nТы продолжил лежать после этого случая. Но через пару часов ты чувствуешь сильную боль в сердце. Тебя зарезали пока ты спал. Начните игру с начала")
#     elif choice2 == "2":
#         print("Они поверили тебе и пробежали дальше")
#         print("После мужчина выходит из мусорки и говорит:\n-Ты спас меня. Я в долгу у тебя. \n осмотрев тебя с головы до ног он продолжил.")
#         print("\nЯ могу тебе помочь. Не хочешь заработать лёгких денег?")
#         print("1) Правда? Я в деле 2) Нет пожалуй откажусь")

#         choice3 = input("Что ты выберешь? (1/2): ")
#         if choice3 == "1":
#             print('Он вытаскивает из под')
        # 
    # 
# elif choice == "2":
#         print("\nВы лежите дальше... но голод напоминает о себе.")
#         print("\nВы снова задумываетесь (Нажмите на f5/кнопка старта ).")
        
# import math
# from turtle import*

# def hearta(k):
#     return 15*math.sin(k)**3
# def heartb(k):
#     return 12*math.cos(k)-5*\
#     math.cos(2*k)-2*\
#     math.cos(3*k)-\
#     math.cos(4*k)
# speed (0)
# bgcolor("black")
# for i in range(6000):
#     goto(hearta(i)*20, heartb(i)*20)
#     for j in range(5):
#         color("red")
#     goto(0,0)
# done()
